{"modelTopology": {"training_config": {"metrics": [], "loss": "binary_crossentropy", "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.5, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false, "lr": 0.0001500000071246177}}, "loss_weights": null, "sample_weight_mode": null}, "keras_version": "2.1.6", "model_config": {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 32768, "batch_input_shape": [null, 1, 1, 100], "use_bias": true, "activity_regularizer": null}}, {"class_name": "Reshape", "config": {"target_shape": [8, 8, 512], "trainable": true, "name": "reshape_1"}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "momentum": 0.5, "name": "batch_normalization_1"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Conv2DTranspose", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_transpose_1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [5, 5]}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "momentum": 0.5, "name": "batch_normalization_2"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Conv2DTranspose", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_transpose_2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [5, 5]}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "momentum": 0.5, "name": "batch_normalization_3"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Conv2DTranspose", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_transpose_3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [5, 5]}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "momentum": 0.5, "name": "batch_normalization_4"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Conv2DTranspose", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_transpose_4", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "kernel_regularizer": null, "filters": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [5, 5]}}, {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_5"}}]}, "backend": "tensorflow"}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "shape": [512], "name": "batch_normalization_1/gamma"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_1/beta"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_1/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_1/moving_variance"}]}, {"paths": ["group2-shard1of1"], "weights": [{"dtype": "float32", "shape": [256], "name": "batch_normalization_2/gamma"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_2/beta"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_2/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_2/moving_variance"}]}, {"paths": ["group3-shard1of1"], "weights": [{"dtype": "float32", "shape": [128], "name": "batch_normalization_3/gamma"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_3/beta"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_3/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_3/moving_variance"}]}, {"paths": ["group4-shard1of1"], "weights": [{"dtype": "float32", "shape": [64], "name": "batch_normalization_4/gamma"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_4/beta"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_4/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_4/moving_variance"}]}, {"paths": ["group5-shard1of4", "group5-shard2of4", "group5-shard3of4", "group5-shard4of4"], "weights": [{"dtype": "float32", "shape": [5, 5, 256, 512], "name": "conv2d_transpose_1/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_transpose_1/bias"}]}, {"paths": ["group6-shard1of1"], "weights": [{"dtype": "float32", "shape": [5, 5, 128, 256], "name": "conv2d_transpose_2/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_transpose_2/bias"}]}, {"paths": ["group7-shard1of1"], "weights": [{"dtype": "float32", "shape": [5, 5, 64, 128], "name": "conv2d_transpose_3/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_transpose_3/bias"}]}, {"paths": ["group8-shard1of1"], "weights": [{"dtype": "float32", "shape": [5, 5, 1, 64], "name": "conv2d_transpose_4/kernel"}, {"dtype": "float32", "shape": [1], "name": "conv2d_transpose_4/bias"}]}, {"paths": ["group9-shard1of4", "group9-shard2of4", "group9-shard3of4", "group9-shard4of4"], "weights": [{"dtype": "float32", "shape": [100, 32768], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [32768], "name": "dense_1/bias"}]}]}